const moment = require("moment-timezone");

module.exports.config = {
  name: 'autotime',
  version: "2.0.0",
  role: 0,
  author: "𝗕𝗔𝗗𝗛𝗢𝗡",
  description: "Sends scheduled messages based on time",
  category: "AutoTime",
  countDown: 3
};

module.exports.onLoad = async ({ api }) => {
  const timeMessages = {
  "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟐:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nঘুমাও মানুষ টা তুমার না__||😊😅\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "01:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟏:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n___এই শহরে এত কিছু হয়শুধু আমার মৃত্যু হয় না.!>🥺\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "02:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟐:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_____💥🦋''হটাৎ কোন একদিন অজান্তে অন্ধকার এ হারিয়ে যাবো..!!>3🥀\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "03:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟑:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nদুঃখ- আমায় ভালোবাসে.!!>😅\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "04:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟒:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n-••🌻🦋🤍বয়স বাড়বে, হারানোর তালিকা দীর্ঘ হবে, যাদের সাথে থাকার কথা ছিলো তারাও হারিয়ে যাবে..!!🦋🌼\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "04:30:00 AM": {
      'message': "╭──────────────────╮\n  🌸𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)"
    },
    "05:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟓:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n__💜🔐🌈 __\n\n🐰!<— ❝“যে ইচ্ছেগুলো কখনোই পূরন হবার না মনটা সবসময় সেটা নিয়েই পড়ে থাকে” ❞ -!!-) 🙃🥀🌻\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "06:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟔:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\_🌸🖤  -𝗣𝗲𝗼𝗽𝗹𝗲 𝗟𝗼𝘀𝘁 𝗜𝗻 𝗘𝘅𝘁𝗿𝗲𝗺𝗲 𝗣𝗿𝗶𝗱𝗲 𝗡𝗲𝘃𝗲𝗿 𝗖𝗼𝗺𝗲 𝗕𝗮𝗰𝗸-!!🙂🐰\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝐉𝐔𝐁𝐀𝐘𝐄𝐑𓆪___//🩷🪽"
    },
    "07:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟕:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n𝐎𝐧𝐞 𝐃𝐚𝐲...☺️\n           ___ღ𝐈𝐧 𝐬𝐡𝐚 𝐀𝐥𝐥𝐚𝐡..😊🖤\n_একদিন আমার মৃত্যুর  খবর শুনে সবাই মুচকি হেসে বলবে...!💔\n_ইন্না-লিল্লাহি ওয়া ইন্না ইলাইহির রাজিউন.!🙂\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "08:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟖:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\-“🐰♡︎𝗕𝗲✨🍥𝗠𝗶𝗻𝗲-!<😻🍭\n\n-!🧚‍♀️𝗜🐼-𝗪𝗶𝗹𝗹✨🍒𝗸𝗲𝗲𝗽😽𝘆𝗼𝘂-🧸💜-𝗙𝗼𝗿𝗲𝘃𝗲𝗿:)🌈\n\n🍒তুমি আমার সাধ্যের বাহিরে চাওয়া এক সুন্দর মানুষ।।🙂💔🥀\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "09:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟗:𝟎𝟎 𝐀𝐌 🩷«—•\n \n✢━━━━━━━━━━━━━━━✢\n\n°🐹💙_𝗧𝗿𝘂𝘀𝘁 M𝗲 🔐\n\n  - 𝗜 𝗮𝗹𝘄𝗮𝘆𝘀 𝗯𝗲𝗹𝗶𝗲𝘃𝗲 𝘁𝗵𝗮𝘁)🐰\n\n__!!>☁️✨🌻''--ভালোবাসি বলেই কি পেতে হবে,,!!🥀\n\n --থাকুক না কিছু ভালোবাসা অপূর্ণ..!!🖤💜🙂💫 ✨\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "10:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟎:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n—-༄༎🖤༎ྂ•——༄༎•গল্পটা তখনই ভালো ছিলো 😊🌸\n\nযখন তুমি ছিলে অপরিচিত আর আমি ছিলাম আমার আমিতে সীমাবদ্ধ༄༎•🙂🖤🦋\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "11:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟏:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_____🐰💫🤍\n\n♡︎– আমার পূর্ণতায়; তাকেই পাশে রাখবো; যে আমার শূন্যতায়; পাশে ছিলো !-🌻🖤\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "12:00:00 PM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟐:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n -(🐰✨𝗜 𝗟𝗼𝘃𝗲 𝗨<33 𝗦𝘂𝗰𝗵 𝗔𝗻 𝗨𝗴𝗹𝘆 𝗪𝗼𝗿𝗱✨🦋-!                                  -!^𝗜𝘁 𝗦𝗵𝗼𝘂𝗹𝗱 𝗕𝗲!ᵉ\n\n_🔐💜💫_একরাশ উচ্ছ্বাসের মাঝে আমার;হটাৎ থেমে যাওয়ার কারণ তুমি..!..>!🌸🌼\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝗕𝗔𝗗𝗛𝗢𝗡 𝗥𝗔𝗛𝗠𝗔𝗡 𝗦𝗛𝗔𝗡𝗧𝗢𓆪___//🩷🪽"
    },
    "01:00:00 PM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟏:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_সর্বহারা পথিকের ছন্নছাড়া আমি
